{"text": "Heet: This group is created to get data to fine tune our model to our talking style. Please talk a lot in this group, only in English, in your own style, and feel free to include some data about you.\n  Heet: An example could be:\n  Heet: Hi I am Heet Patel, I come from Surat, Gujarat\n  Heet: Currently I am studying in Data Science and Artificial Intelligence branch of IIT Guwahati\n  Heet: Personally, I feel the location of our college is nice, considering the fact that it sort of opens for us the option of exploring North East India more and more\n  Heet: Feel free to share your opinions\n  Heet: We currently have a lab called Python programming lab which is taught by Teena Ma’am who is our instructor for the particular course ‎<This message was edited>\n  Heet: Hi guys\n  Heet: what are you all doing?\n  Heet: or should i ask, how are ya’ll doing?\n  Heet: please keep this group active as we need a lot of chats in our very own styles to fine tune the model so we can show that it actually does copy our style\n  Heet: and as fast as possible, we need to fill this group with a lot of texts\n  Heet: damn\n  Heet: thats a lot of work\n  Heet: but\n  Heet: we need to do it\n  Heet: no other option\n  Heet: this is the most laborious task ever, give me a break\n  Heet: come on guys where are y’all, how’d you think we should proceed\n  Heet: i mean, we could create A LOT of data and then use it with our model to make sense from it\n  Heet: or else it won’t be worth it\n  Heet: talk here\n  Heet: A LOT\n  Heet: hugeee\n  Heet: LOTTT\n  Heet: pleaseeee\n  Prince: Hey there, I am Prince Tholia\n  Prince: I am a 2nd year B.Tech student at IITG. Currently, I am pursuing the subject of data science and artificial intelligence.\n  Prince: And yeah! I got the assigned task. I will try to text here every single minute.\n  Prince: And yeah! I just woke up\n  Prince: Pardon me\n  Heet: oh damn\n  Heet: niceee\n  Heet: it's alright though, keep talking and everything is going to be fine"}
{"text": "Onkar: Hello guys, I am onkar Shinde\n Prince: Yeah! Everything is going to be fine. This statement is just crap, bro. I almost wasted my semester with this. Nothing comes fine until we make it\n  Prince: Hi onkar, how are you doing dude?\n  Onkar: I am studying at IIT Guwahati in the 2nd year.\n  Prince: I know I know\n  Heet: true\n  Heet: what to do\n  Heet: no option there\n  Onkar: Nice bro\n  Heet: i mean, we are sort of stuck here in IIT in a boring monotonous day to day life\n  Onkar: We have to do it together guys\n  Heet: let's make a chatbot that breaks that barrier, amigos\n  Prince: What, wasting the whole semester?\n  Heet: let's conquer the world\n  Heet: damn\n  Prince: Yoooooooo!\n  Prince: Let's do it\n  Heet: haha\n  Onkar: Not wasting semester bro. We have to do some productive work\n  Onkar: Like we r making this model\n  Prince: For that thing, I am in\n  Heet: yessir\n  Heet: all in for productive stuff\n  Heet: and reproductive too for that matter 😂\n  Prince: Anytime\n  Prince: Anywhere\n  Prince: +\n  Prince: +\n  Onkar: 😁😁\n  Heet: damn 💀\n  Heet: we are getting dataaaaa\n  Heet: niceee\n  Heet: once we reach about 500-600 texts, it'll be fine\n  Heet: till then\n  Heet: pour everything in here\n  Onkar: Guys do u know the profits of going to Japan ?\n  Heet: that was random\n  Heet: but tell me\n  Heet: Japan's a pretty country\n  Heet: Heet loves asian\n  Heet: also, I've got a dream of travelling the entire freaking world\n  Heet: such high bars\n  Onkar: Let the first place be Japan then!!\n  Prince: I know what your dreams is🫣\n  Onkar: RAG is one of  the major attractions\n  Heet: and what we do is sit here at a useless place and do useless stuff, let's make this  chatbot a very useful thing 😎\n  Prince: It looks like name of a fucking game bro\n  Prince: So that we can print money with it 💰\n  Prince: Let's make some fucking cash baby! 💸"}
{"text": "Prince: Hey! In earlier days when I was a child I used to believe that data is famous name for a child in US and when I saw news that more and more is generated nowadays, I used to think that it's a metaphor that America's population is increasing.\n Heet: baapre 💀\n  Heet: *damn\n  Heet: well true though\n  Heet: let's make some data\n  Heet: suspicious activities\n  Onkar: With drip\n  Prince: I don't think that's a nice idea\n  Prince: I wonder that some government agency is reading our chats\n  Onkar: But which is what attracts me\n  Prince: And although we are students they may suspect us as terrorist\n  Onkar: Ohh but we don't have sahil in our group\n  Heet: they'd be very confused bro\n  Heet: confused out of their freaking minds\n  Heet: damn Sahil's a terrorist?💀\n  Onkar: No he is not\n  Onkar: I'm just giving a reference 😀\n  Heet: 👀\n  Heet: suspicious activities\n  Prince: Don't tell anyone, but I suspect him\n  Prince: Why don't we focus on studies then?\n  Prince: Huh,tell me\n  Heet: also guys, let's also talk about our daily lives, what we could talk on a daily basis, so the suggestions would be based on that, could really increase our chances of relevant output\n  Onkar: Guys I am on the bus going to the city\n  Onkar: For party  🥳\n  Prince: I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n I wake up\n I eat \n I go to classes\n I sleep\n  Onkar: Where r u guys ?\n  Prince: I could be on my bed, with my girlfriend(I wish)\n  Onkar: Dreams may come true\n  Heet: haha\n  Heet: everyone wishes\n  Heet: damn what party??\n  Heet: ill be on a bus for a party in about 2 hours\n  Onkar: Tasveer afterparty\n  Heet: ohhhh\n  Heet: nicee"}
{"text": "Heet: where are y'all going??\n Onkar: Don't know\n  Onkar: It's secret 😔\n  Onkar: But I'm too excited\n  Heet: baapre\n  Heet: makes sense\n  Prince: 🤡\n  Heet: fun bro fun\n  Onkar: Yup 😛\n  Heet: lessgoooo\n  Onkar: Heet where r u going for party?\n  Prince: I hope no one carrying a bomb 💣\n  Prince: Heat goes to city every weekend\n  Heet: we haven't decided yet, so it's a secret for our freshers too 💀\n  Onkar: Nice\n  Prince: Ah! Not this weekend\n  Onkar: U know there is checking while entry of bus so that no one carries it inside campus 🙃\n  Prince: Heet who else will be accompany you\n  Prince: I am talking of girls\n  Heet: udgam disrupt freshers\n  Onkar: Prince will be happy if you invited him in the party\n  Heet: you remember I was in this entrepreneurship summit called udgam?\n  Heet: I worked in the disrupt module in it\n  Prince: My boy my boy😘\n  Onkar: What is udgam\n  Onkar: ??\n  Heet: so we're throwing a party for the people of disrupt\n  Heet: especially the freshers\n  Onkar: Okie\n  Prince: Seniors, name them\n  Onkar: That means u don't want to take prince with you.\n  Heet: oh it is an entrepreneurship summit hostel by IIT Guwahati\n  Prince: Oh boy,oh boy!\n  Heet: it's quite big you know, i mean if you consider that after all it's just a big ass business meeting\n  Heet: me, Mansi, shanu, Rahul\n  Heet: all 2nd year\n  Heet: also, onkar bro what's tasveer\n  Onkar: Rahul Kumar from Kapili 👀\n  Heet: i hope so\n  Heet: but I'm not sure if he's coming or not\n  Heet: I feel like he's pretty busy in his bihu situation\n  Onkar: Tasveer is conducted every year by montage photography club of iitg.\n  Prince: Do you need a substitute\n  Onkar: In it photography exhibition\n  Heet: I'll ask shanu and mansi\n  Prince: Don't please\n  Heet: but as a substitute, are you saying you're gonna pay for the freshers too?👀\n  Prince: Before that you need to tell me the place where we all are up to\n  Prince: 😂\n  Heet: we were thinking swad\n  Prince: Don't mess with me now"}
{"text": "Heet: it's an all veg restaurant, somewhat like ghoomar, but here you get 15% discount\n Heet: cause they were our sponsors sometime\n  Heet: ohhh\n  Prince: Hehe\n  Heet: what all do you display?\n  Prince: So, I am in?\n  Heet: should I ask them?\n  Onkar: We display best photos of campus people and club members\n  Onkar: And we give prices to b at 3 entries\n  Onkar: Best*\n  Heet: ohhh\n  Heet: funn\n  Heet: talk more guys\n  Heet: keep them coming\n  Heet: this is our world\n  Heet: as perceived by AI\n  Heet: goodnightt everyone\n  Heet: even though it is morning\n  Heet: it is night\n  Prince: Yeah! It's bright but I can see darkness 😎\n  Prince: I can't see anything that's why it's dark tho\n  Heet: damn\n  Heet: when did you go blind?\n  Prince: Someone picked my eyes while I was high\n  Heet: bro\n  Prince: Chill out I got spider sense\n  Heet: high as in the highest floor of research building?\n  Prince: I did go there yesterday but there was free paneer muglai so I had to come back\n  Heet: ohhh\n  Heet: paneer mughlai rolls yumm\n  Heet: very yumm\n  Heet: i like\n  Heet: ayo folks, keep the conversation goingg\n  Heet: we gonna train that freaking AI tonight\n  Prince: This is a tedious task\n  Prince: Can't we just train it through the iit advisement park\n  Heet: no English there bro\n  Heet: sadly\n  Prince: Ah! True\n  Prince: When is the project submission\n  Prince: Wait lemme check\n  Prince: Everything is on 17th of April\n  Prince: Which is Wednesday by the way\n  Prince: By the way I just got a bath now\n  Prince: And it's soothing\n  Prince: OMG I feel so relaxed and cherished\n  Heet: suspicious bhai\n  Heet: very suspicious\n  Heet: true\n  Heet: let's hope we finish before that\n  Heet: I'll try and train the model tonight\n  Heet: one of you make the keyboard software if possible\n  Prince: Sure, I am on it\n  Prince: I will have my dinner first\n  Prince: But I will talk to my parents beforehand\n  Prince: After dinner I will read a book until 8 PM\n  Heet: aight"}
{"text": "Prince: Thereafter, I will start looking for one\n Prince: Sorry, I didn't do it last night but I will make up for it today\n  Heet: ahh that's fine\n  Heet: even I'll search for something\n  Heet: and preferably see if it's python based\n  Prince: Cool cool\n  Heet: aight then\n  Heet: also, keep chatting here so we get more and more data\n  Prince: We should get help of very talkative peeps\n  Prince: Girls are talkative, we may use them\n  Prince: But girls are dumb too, they will ruin our project\n  Heet: 💀\n  Heet: chill\n  Heet: bro\n \n  Heet: Yo bro, did you hear about the concert next weekend?\n  Prince: Yessir, I'm already hyped for it. Are tickets still available?\n  Onkar: Damn, I forgot to grab mine. Let me check real quick.\n  Heet: Hurry up, bro! It's gonna be insane.\n  Prince: Shitt, they're almost sold out. Better grab 'em now.\n  Onkar: Got 'em! Let's goooo!\n  Heet: Nice one, Onkar! This concert is gonna be epic.\n  Prince: Absolutely! Can't wait to see the lineup.\n  Onkar: Bro, remember that road trip we talked about?\n  Heet: Yeah, we should plan it soon. Where are we heading?\n  Prince: How about the mountains? Camping and hiking vibes.\n  Onkar: Damnn, that sounds amazing! Count me in.\n  Heet: Let's do it next month. It'll be a dope getaway.\n  Prince: Aight, I'm down. We'll make it happen.\n  Onkar: Bro, did you catch the game last night?\n  Heet: Nah, missed it. How did our team do?\n  Prince: We crushed 'em! It was a blowout victory.\n  Onkar: Shitt, that's awesome! They're on fire this season.\n  Heet: Yessir, playoffs here we come!\n  Prince: Let's grab tickets for the next home game.\n  Onkar: Good idea! It'll be wild in the arena.\n  Heet: Yo, anyone up for pizza tonight?\n  Prince: Always down for pizza! Count me in.\n  Onkar: Damnn, pizza sounds perfect right now.\n  Heet: Let's order in. What toppings are we feeling?\n  Prince: Extra cheese and pepperoni, no doubt.\n  Onkar: Aight, I'll place the order. Lessgoo!\n \n  Heet: Aight, who's up for some hoops tomorrow?"}
{"text": "Prince: Yess, let's see...\n Onkar: Sounds good, count me in.\n  Heet: Bro, you catch that new series?\n  Prince: Shitt, it's wild!\n  Onkar: Yeah, binge-watched it last night.\n  Heet: Hey, want to hit the gym later?\n  Prince: Lessgoo, I need a workout!\n  Onkar: Sure thing, I'm down.\n  Heet: Yo, pizza or burgers tonight?\n  Prince: Aight, let's do pizza.\n  Onkar: Pizza sounds good to me.\n \n  Heet: Yo bro, did you check out that new show on Netflix?\n  Prince: Not yet, what's it about?\n  Onkar: It's a thriller series, man. Keeps you on the edge.\n  Heet: Sounds dope, let's binge-watch it this weekend.\n  Prince: Count me in! Popcorn ready?\n  Onkar: Absolutely, bro. It's gonna be lit.\n  Heet: Hey guys, did you hear about Sam's new job?\n  Prince: No way, what's he up to now?\n  Onkar: He joined that tech startup, I think. Good for him!\n  Heet: That's awesome. We should celebrate this weekend.\n  Prince: Aight, dinner and drinks on me!\n  Onkar: Sounds like a plan. Let's make it happen.\n  Heet: Bro, remember that road trip we took last summer?\n  Prince: Yeah, that was epic. Best memories!\n  Onkar: We gotta do another one soon. Explore new spots.\n  Heet: Absolutely! Let's plan a coastal drive this time.\n  Prince: Count me in, I'm ready for some beach vibes.\n  Onkar: Lessgoo! It's gonna be legendary.\n  Heet: Yo, did you guys catch that viral video yesterday?\n  Prince: Which one? I'm always behind on these things.\n  Onkar: It was hilarious! I'll send it to you.\n  Heet: Nice, can't wait to see it. Let's share the laughs.\n  Prince: Appreciate it, bro. You always find the best stuff.\n  Heet: Hey, are we still up for the gym session later?\n  Prince: Absolutely! Leg day today, let's crush it.\n  Onkar: I'm in. Need to work off that pizza from last night.\n  Heet: Bro, gains incoming! Let's get swole.\n  Prince: Hell yeah, pump it up!\n  Onkar: Yo, did you guys see that new sneaker drop?\n  Heet: Yeah, those kicks are fire! Gotta cop a pair.\n  Prince: Resale prices are crazy though, damn."}
{"text": "Onkar: True, it's a hype game. Gotta be quick.\n Heet: Keep an eye out for the restock, bro.\n \n  Heet: Aight, how about we plan a trip to Meghalaya next month? I mean, that place is stunning, ummm... okayy, let's see... we can start with Shillong, check out the living root bridges, and then head to Cherrapunji. What do you guys think?\n  Onkar: Sounds dope, Heet! Those living root bridges are crazy cool. Count me in for sure.\n  Prince: Yeah man, Meghalaya's been on my radar too. I'm down for some adventure.\n  Heet: Okayy, so we could start by taking a ferry to Guwahati, and then make our way to Shillong. I mean, the drive up there is breathtaking, broo. Umm, we'll need a solid plan for where to stay though.\n  Onkar: Yessir, I'm up for it! We could rent a cozy place in Shillong and use that as our base. Then we can head out to explore during the day.\n  Prince: Sounds chill. I'm all about those scenic drives. Shillong's vibe is so laid-back, lessgoo!\n  Heet: Exactly, Prince! And the food scene there is legit, so we'll have to try out some local spots. Oh, and the music scene is pretty awesome too.\n  Onkar: Shitt, I'm getting excited just thinking about it. I've heard they have some epic waterfalls around there too. Count me in for all the adventures!\n  Heet: Yeahhhh, bro! We'll definitely hit up those waterfalls. Imagine the photos we'll get, nice!\n  Prince: It's gonna be epic, guys. Can't wait to explore Meghalaya with you all. I mean, there's so much to see and do. Umm, we should also check out Cherrapunji, known for its stunning landscapes and living root bridges.\n  Onkar: Ohh yeah, Cherrapunji is a must-visit! Those root bridges are something else. We could plan a day trip from Shillong to explore Cherrapunji's natural beauty.\n  Heet: Totally agree, Onkar. Plus, the drive from Shillong to Cherrapunji is insane. Hairpin bends and lush greenery everywhere!"}
{"text": "Prince: Damn, that sounds like a road trip I'm ready for. Let's make sure to pack some good music for the ride!\n Heet: Ohh for sure, Prince! We'll have a sick playlist ready. Maybe some classic rock mixed with local tunes to set the vibe.\n  Onkar: Aight, count me in on the playlist selection. We'll have the ultimate road trip soundtrack!\n  Heet: Can't wait to hit the road with you guys. Meghalaya is gonna be a blast!\n \n  Heet: Speaking of cool experiences, life at IIT Guwahati is something else. I mean, the campus vibes during fests are off the charts!\n  Onkar: Ohh yeah, I've heard the fests there are legendary. Umm, what's your favorite memory from one of the fests?\n  Heet: Well, broo, the cultural fest was insane last year. The performances, the food stalls, everything was top-notch. Plus, meeting people from all over was such a vibe.\n  Prince: That sounds amazing. I've always wanted to experience the fest scene at IITG. Did you guys participate in any events?\n  Onkar: Yessir, I was part of a dance crew for the fest. We spent weeks rehearsing, but the energy on stage was worth it. Shitt, the crowd was hyped!\n  Heet: Nice one, Onkar! Umm, I remember the tech fest too. The innovation showcased was mind-blowing. From robotics to AI demos, it was like a glimpse into the future.\n  Prince: Sounds fascinating. I mean, studying at IITG must be intense, but these experiences make it all worth it.\n  Heet: Definitely, Prince. The academic challenges push you, but the campus life and friendships you build are what make it special. Plus, the natural beauty around Guwahati is a bonus!\n  Onkar: Yeahhhh, balancing studies with extracurriculars is key. Plus, Guwahati's location opens up so many opportunities for exploring the Northeast.\n  Heet: For sure, Onkar. Umm, it's a unique blend of academic rigor and cultural experiences that make IIT Guwahati such an enriching place to study."}
{"text": "Heet: Hey guys, have you heard about the cycle thefts happening on campus recently? It's getting crazy, man.\n Onkar: Ohh yeah, it's been going around. Umm, someone even stole my friend's bike last week. It's becoming a real nuisance.\n  Prince: Damn, that's messed up. I mean, we're all students here trying to focus on studies, and then we have to worry about our bikes getting stolen?\n  Heet: Yeah, broo, it's a hassle. A few guys I know had their bikes disappear too. Yessir, the security needs to step up their game.\n  Onkar: Totally agree, man. Shitt, it's frustrating when you can't even leave your bike parked safely. They should install more CCTV cameras or something.\n  Prince: I heard they're planning to increase patrolling in the residential areas. I mean, that might help deter these thieves.\n  Heet: Let's hope so, Prince. It's about time they took some serious action. Umm, have you guys been taking extra precautions with your bikes?\n  Onkar: Yeah, I've started locking my bike to a more secure spot. Can't be too careful, yk?\n  Heet: Niceeee, Onkar. Aightt then, let's keep an eye out.\n \n  Heet: Hey guys, let's meet up at the library later today to hit the books. I mean, we've got those upcoming exams to crush.\n  Onkar: Sounds good, bro. I'm down for some study sessions. Umm, we can tackle those tough subjects together.\n  Prince: Yeahhh, count me in too. Library sessions are always productive. Lessgoo!\n  Heet: Nice, see you guys there around 6? Aight, let's grab our notes and textbooks.\n  Onkar: Perfect. I'll bring my laptop too. We might need it for research or solving practice problems.\n  Prince: Great idea, Onkar. I mean, the more resources, the better. We gotta ace these exams.\n  Heet: Absolutely, broo. We're aiming for the stars here. Yessir, we'll make the library our second home for the next few days.\n  Onkar: You know it! Shitt, I've got some challenging chapters to go over. It's grind time."}
{"text": "Prince: Same here, man. I've been struggling with those calculus problems. But we'll figure it out together.\n Heet: No worries, Prince. We'll break it down step by step. Umm, let's also take short breaks to keep our minds fresh.\n  Onkar: Good plan. Okayy, I'll bring some snacks to keep us fueled. Can't study on an empty stomach, right?\n  Heet: Exactly, Onkar. Bro, you're the snack master. Lessgoo with those study snacks!\n  Prince: Haha, sounds like a plan. I mean, let's make this study session as efficient as possible.\n  Heet: Alrighty, see you guys at 6 then. Aight, let's crush it!\n \n  Heet: Hey guys, we gotta get cracking on that Python project. It's due on the 17th, and you know Teena Sharma doesn't mess around.\n  Onkar: Oh damn, I almost forgot about that. Umm, what are we working on again? Was it the AI chatbot model?\n  Prince: Yeah, bro. We gotta create an AI model that mimics our conversations. I mean, it's a cool project but kinda challenging.\n  Heet: Absolutely. Teena wants us to demonstrate natural language processing techniques. Yessir, we gotta make it realistic and responsive.\n  Onkar: Alright, let's break it down. I mean, we can start by collecting our chat data and then implementing the model with NLTK.\n  Prince: Good plan, Onkar. We also need to think about the user interface. Shitt, I haven't touched tkinter in ages.\n  Heet: No worries, Prince. We'll figure it out together. Umm, maybe we can start with basic text generation using Markov chains?\n  Onkar: Yeah, that could work. Okayy, let's divide the tasks. I'll handle the data preprocessing and model training.\n  Prince: I'll work on the UI design then. Lessgoo, time to bring out my creative side.\n  Heet: Sounds good, guys. I'll take care of integrating everything and testing the chatbot's functionality. Aight, let's aim to finish by tomorrow evening.\n  Onkar: Yeahhh, we got this. I mean, it's gonna be a late night for us, but it'll be worth it to impress Teena."}
{"text": "Prince: Absolutely. Shitt, I can already imagine her reaction if we pull this off smoothly.\n Heet: Haha, let's make her proud. Alrighty, let's get to work. Python, here we come!\n \n  Heet: Guys, I'm running into some issues with the data preprocessing. Umm, the dataset is messy and needs a lot of cleaning.\n  Onkar: Oh man, that sounds like a pain. I mean, what kind of cleaning are we talking about?\n  Heet: Well, lots of missing values, inconsistent formatting, and unnecessary characters. It's taking longer than expected to get it ready for training.\n  Prince: Damn, that does sound tedious. Okayy, how can we help speed things up?\n  Heet: Maybe if you guys could start drafting the UI layout, it would take some load off my plate. Yessir, I just need a bit more time to clean this data.\n  Onkar: Sure thing. Lessgoo, Prince, let's brainstorm some design ideas for the chat interface.\n  Prince: Alright, I'm on it. I mean, we'll keep it simple yet engaging. Shitt, I hope I remember all those tkinter commands.\n  Heet: Thanks, guys. Umm, I'll keep you posted on my progress with the data. Hopefully, we can sync everything up smoothly by tonight.\n  Onkar: No rush, Heet. We'll make sure the UI is ready for integration when you're done with the data prep.\n  Prince: Yeahhh, teamwork makes the dream work. I mean, we're in this together, no matter what challenges come our way.\n  Heet: Absolutely, Prince. Alright, back to the grind. Let's tackle this one step at a time.\n  Onkar: Sure thing. Lessgoo, Prince, let's brainstorm some design ideas for the chat interface.\n  Prince: Alright, I'm on it. I mean, we'll keep it simple yet engaging. Shitt, I hope I remember all those tkinter commands.\n  Heet: Thanks, guys. Umm, I'll keep you posted on my progress with the data. Hopefully, we can sync everything up smoothly by tonight.\n  Onkar: No rush, Heet. We'll make sure the UI is ready for integration when you're done with the data prep."}
{"text": "Prince: Yeahhh, teamwork makes the dream work. I mean, we're in this together, no matter what challenges come our way.\n Heet: Absolutely, Prince. Alright, back to the grind. Let's tackle this one step at a time.\n \n  Heet: Guys, I had lunch at Kameng mess today. Umm, the food quality is getting worse.\n  Onkar: Damnnn, really? That's disappointing.\n  Prince: Let's seee, maybe it's just today. Was it the usual menu?\n  Heet: Yeah, but the rice was undercooked, and the dal was too watery. Shitt, I barely finished my plate.\n  Onkar: That's rough, man. I mean, they need to step up their game.\n  Prince: Totally. Sadd to hear about this. We should probably start exploring other options around the campus.\n  Heet: Good idea. Aight, let's make a list of alternative places we can try out this week.\n  Onkar: Sounds like a plan. I mean, it's worth trying new spots if Kameng mess isn't cutting it anymore.\n  Prince: Yeahhh, let's keep our options open. I'm sure we'll find better places to eat.\n \n  Heet: By the way, have you guys tried that new tea stall near the Khokha gate?\n  Onkar: The one with the colorful chairs? Yeah, been there once.\n  Prince: Haven't checked it out yet.\n  Heet: It's not bad, actually. Aight, we should go there sometime after class maybe.\n  Onkar: Okayy, sounds like a plan. What about tomorrow?\n  Prince: Let's seee, I'm free after 4 PM. Works for you guys??\n  Heet: Yessir, I'm good with that. \n  Onkar: Nicee\n \n  Heet: man, this semester is getting crazier by the day. So much to juggle!😭\n  Onkar: I know, right? Assignments piling up, club meetings, and then that surprise quiz last week. Ugh!\n  Prince: Shitt, tell me about it. I've got this Python project due in two days. Stress levels through the roof.\n  Heet: yeahhhh, Teena Sharma's Python lab is no joke. Have you started coding for the project yet?💀\n  Onkar: Barely, man. Umm, I'm stuck on the chat replication part. Any progress on your end?"}
{"text": "Prince: Not really. I mean, the AI model part is tricky. Trying to figure out the training data set.\n Heet: damn, we should meet up at the library later. Maybe we can brainstorm some ideas together.\n  Onkar: Sounds like a plan. I'll bring my laptop. Let's get this thing sorted out!\n  Prince: Aight, see you guys there in an hour??😶‍🌫️\n  Heet: yeah, let's make it happen. We gotta crack this before it cracks us!💀\n  Onkar: Definitely. We can't afford to leave it till the last minute.\n  Prince: For sure. Plus, I've got that dbms assignment due the day after. Talk about timing, right?\n  Heet: ughh, double trouble. I still haven't started on my presentation for the club next week.\n  Onkar: Broo, you're doing a presentation too? It's like the universe decided to throw everything at us at once.\n  Prince: Tell me about it. Can't even remember the last time I had a decent meal without rushing.🤠\n  Heet: the struggle is real. Sometimes I feel like we're running a marathon with no finish line in sight.\n  Onkar: But hey, once we survive this, we'll be legends. Remember that time we pulled off that hackathon project?\n  Prince: Ohh yeah, good times. We nailed it despite the chaos. This is just another bump in the road.\n  Heet: exactly. We got this, guys. Let's grind through it and celebrate with a massive feast at the end.🥰\n  Onkar: Lessgoo! Can't wait for that victory meal. But first, let's conquer these assignments and projects!\n \n  Heet: yo guys, anyone up for a quick study sesh at the library tonight??\n  Onkar: Yeahh, I'm down. Got that AI project looming over my head.\n  Prince: Count me in too. Need to finish this econ assignment before it drives me crazy.\n  Heet: nicee! Library at 9:00 PM. We'll smash through this work like pros.😎\n  Onkar: Aight, see you guys there. Gotta grab some snacks first, though.\n  Prince: Make it quick bro, we need all hands on deck for this grind session.\n  Heet: don't worry, I'll bring the energy drinks. Let's make tonight count!👊🏿"}
{"text": "Onkar: Lessgoo! It's go time. Catch you guys in a bit.\n Prince: Yessir! Time to crush these tasks. See you soon, fellas!\n  Heet: you know it! Library takeover, here we come!\n \n  Heet: wheree are y'all??\n  Prince: Coming, sorry for the delay, bro.\n  Onkar: Yes, almost on our way.\n  Heet: guys, be quick, don't have a lott of time in our hands.🥲\n  Heet: and bring laptops...\n  Onkar: Reached there.\n  Prince: Anyone up??\n \n  Heet: sorry about that, just finished up some code. what's next? 😅\n  Onkar: I'm diving into this dev problem. It's a doozy.\n  Prince: Trying to debug this AI model. It's throwing errors left and right. 🤖\n  Heet: alright, I'll help with the debugging. what's the issue?\n  Onkar: My laptop froze again. Ugh, these late-night coding sessions...\n  Prince: Think we'll make it out of here before sunrise?\n  Heet: hopefully! this project's been a marathon, not a sprint. 🏃‍♂️\n  Onkar: Just need to wrap this up before Teena's deadline.\n  Prince: Counting down the hours till submission. ⌛\n  Heet: yessir! Let's push through. 💪\n \n  Heet: how much did y'all complete??💀\n  Onkar: Not a lot, sadly.\n  Prince: Haha same same. What do we do?\n  Heet: aight, let's get going and complete it today itself, no point delaying.\n  Onkar: Okay\n  Prince: Today is going to be looong🥲\n  Onkar: Let's just complete quickly\n  Prince: Just one day bro, one day.\n  Heet: lessgooo"}
